; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   black_block_2 black_block_1 purple_block_1 green_block_1 green_block_2 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (and (ontable purple_block_1) (not (= ?obj purple_block_1)))) (or (= ?obj green_block_1) (holding green_block_1))) (hold_0)) (when (and (not (on purple_block_1 black_block_2)) (not (or (= ?obj black_block_1) (holding black_block_1)))) (not (hold_2))) (when (or (= ?obj black_block_1) (holding black_block_1)) (hold_2)) (when (and (on green_block_2 black_block_1) (not (and (clear purple_block_1) (not (= ?obj purple_block_1))))) (hold_4)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (or (= ?obj purple_block_1) (ontable purple_block_1))) (holding green_block_1) (not (= ?obj green_block_1))) (hold_0)) (when (and (not (on purple_block_1 black_block_2)) (not (and (holding black_block_1) (not (= ?obj black_block_1))))) (not (hold_2))) (when (and (holding black_block_1) (not (= ?obj black_block_1))) (hold_2)) (when (and (on green_block_2 black_block_1) (not (or (= ?obj purple_block_1) (clear purple_block_1)))) (hold_4)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (and (not (ontable purple_block_1)) (holding green_block_1) (not (= ?obj green_block_1))) (hold_0)) (when (not (or (and (= ?obj purple_block_1) (= ?underobj black_block_2)) (on purple_block_1 black_block_2))) (hold_1)) (when (and (not (or (and (= ?obj purple_block_1) (= ?underobj black_block_2)) (on purple_block_1 black_block_2))) (not (and (holding black_block_1) (not (= ?obj black_block_1))))) (not (hold_2))) (when (and (holding black_block_1) (not (= ?obj black_block_1))) (hold_2)) (when (not (or (and (= ?obj green_block_2) (= ?underobj black_block_2)) (on green_block_2 black_block_2))) (hold_3)) (when (and (or (and (= ?obj green_block_2) (= ?underobj black_block_1)) (on green_block_2 black_block_1)) (not (or (= ?obj purple_block_1) (and (clear purple_block_1) (not (= ?underobj purple_block_1)))))) (hold_4)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (and (not (ontable purple_block_1)) (or (= ?obj green_block_1) (holding green_block_1))) (hold_0)) (when (not (and (on purple_block_1 black_block_2) (not (and (= ?obj purple_block_1) (= ?underobj black_block_2))))) (hold_1)) (when (and (not (and (on purple_block_1 black_block_2) (not (and (= ?obj purple_block_1) (= ?underobj black_block_2))))) (not (or (= ?obj black_block_1) (holding black_block_1)))) (not (hold_2))) (when (or (= ?obj black_block_1) (holding black_block_1)) (hold_2)) (when (not (and (on green_block_2 black_block_2) (not (and (= ?obj green_block_2) (= ?underobj black_block_2))))) (hold_3)) (when (and (on green_block_2 black_block_1) (not (and (= ?obj green_block_2) (= ?underobj black_block_1))) (not (or (= ?underobj purple_block_1) (and (clear purple_block_1) (not (= ?obj purple_block_1)))))) (hold_4)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
 )
 (:init (ontable green_block_1) (on black_block_1 green_block_1) (ontable black_block_2) (on green_block_2 black_block_2) (ontable purple_block_1) (clear black_block_1) (clear green_block_2) (clear purple_block_1) (handempty) (hold_1) (= (total-cost) 0))
 (:goal (and (ontable black_block_1) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack green_block_2 black_block_2)
   deleted: (on green_block_2 black_block_2) (clear green_block_2) (handempty)
   added: (holding green_block_2) (clear black_block_2) (hold_3)
   goals met: 2 of 6
2. (stack green_block_2 black_block_1)
   deleted: (clear black_block_1) (holding green_block_2)
   added: (handempty) (clear green_block_2) (on green_block_2 black_block_1)
   goals met: 2 of 6
3. (pickup purple_block_1)
   deleted: (clear purple_block_1) (ontable purple_block_1) (handempty)
   added: (holding purple_block_1) (hold_4)
   goals met: 3 of 6
4. (stack purple_block_1 black_block_2)
   deleted: (clear black_block_2) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 black_block_2)
   goals met: 3 of 6
5. (unstack green_block_2 black_block_1)
   deleted: (on green_block_2 black_block_1) (clear green_block_2) (handempty)
   added: (holding green_block_2) (clear black_block_1)
   goals met: 3 of 6
6. (putdown green_block_2)
   deleted: (holding green_block_2)
   added: (clear green_block_2) (handempty) (ontable green_block_2)
   goals met: 3 of 6
7. (unstack black_block_1 green_block_1)
   deleted: (on black_block_1 green_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear green_block_1) (hold_2)
   goals met: 4 of 6
8. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 5 of 6
9. (pickup green_block_1)
   deleted: (clear green_block_1) (ontable green_block_1) (handempty)
   added: (holding green_block_1) (hold_0)
   goals met: 6 of 6
